# Pandas (2)

Материалы:
* Макрушин С.В. "Лекция 2: Библиотека Pandas"
* https://pandas.pydata.org/docs/user_guide/index.html#
* https://pandas.pydata.org/docs/reference/index.html
* Уэс Маккини. Python и анализ данных

In [1]:
import pandas as pd
import numpy as np

C:\Users\Артём\AppData\Roaming\Python\Python38\site-packages\pandas\core\computation\expressions.py:20: UserWarning: Pandas requires version '2.7.3' or newer of 'numexpr' (version '2.7.1' currently installed).
  from pandas.core.computation.check import NUMEXPR_INSTALLED

## Задачи для совместного разбора

1. Загрузите данные из файла `sp500hst.txt` и обозначьте столбцы в соответствии с содержимым: `"date", "ticker", "open", "high", "low", "close", "volume"`.

In [5]:
df = pd.read_csv('C:\\Users\\Артём\\OneDrive - ФГОБУ ВО Финансовый университет при Правительстве РФ\\Учёба\\3 курс\\Технологии обработки BD\\ТОБД22-ПМ20-Материалы к семинарам\\02_pandas\\02_pandas_data\\sp500hst.txt', sep=',', header=None, names=["date", "ticker", "open", "high", "low", "close", "volume"], parse_dates=['date'])
df.head(5)

        date ticker   open     high     low  close  volume
0 2009-08-21      A  25.60  25.6100  25.220  25.55   34758
1 2009-08-24      A  25.64  25.7400  25.330  25.50   22247
2 2009-08-25      A  25.50  25.7000  25.225  25.34   30891
3 2009-08-26      A  25.32  25.6425  25.145  25.48   33334
4 2009-08-27      A  25.50  25.5700  25.230  25.54   70176

In [6]:
df.ticker = df.ticker == 'A'
df

             date  ticker   open     high     low  close  volume
0      2009-08-21    True  25.60  25.6100  25.220  25.55   34758
1      2009-08-24    True  25.64  25.7400  25.330  25.50   22247
2      2009-08-25    True  25.50  25.7000  25.225  25.34   30891
3      2009-08-26    True  25.32  25.6425  25.145  25.48   33334
4      2009-08-27    True  25.50  25.5700  25.230  25.54   70176
...           ...     ...    ...      ...     ...    ...     ...
122569 2010-08-13   False  51.72  51.9000  51.380  51.44   14561
122570 2010-08-16   False  51.13  51.4700  50.600  51.00   13489
122571 2010-08-17   False  51.14  51.6000  50.890  51.21   20498
122572 2010-08-19   False  51.63  51.6300  50.170  50.22   18259
122573 2010-08-20   False  50.03  50.5500  49.480  49.82   17792

[122574 rows x 7 columns]

2. Посчитайте количество уникальных цифр, которые используются каждой строке в столбце volume.

In [3]:
unique_num = df.volume.astype(str).map(lambda x: len(set(x)))
unique_num

0         5
1         3
2         5
3         2
4         4
         ..
122569    4
122570    5
122571    5
122572    5
122573    4
Name: volume, Length: 122574, dtype: int64

3. Для каждой строки рассчитайте разность между значениями high и low, если индекс столбца нечетный, и разность между close и high в противном случае.

In [4]:
def diff(row):
    if row.name % 2:
        return row['high'] - row['low']
    else:
        return row['close'] - row['high']

In [5]:
df.apply(diff, axis=1)

0        -0.0600
1         0.4100
2        -0.3600
3         0.4975
4        -0.0300
           ...
122569    0.5200
122570   -0.4700
122571    0.7100
122572   -1.4100
122573    1.0700
Length: 122574, dtype: float64

In [6]:
# Оптимизированный вариант 
import numpy as np

np.where(
    df.index % 2 == 1,
    df['high'] - df['low'],
    df['close'] - df['high']
)

array([-0.06,  0.41, -0.36, ...,  0.71, -1.41,  1.07])

4. Рассчитайте суммарный объем торгов для для одинаковых значений тикеров.

5. Загрузите данные из файла sp500hst.txt и обозначьте столбцы в соответствии с содержимым: "date", "ticker", "open", "high", "low", "close", "volume". Добавьте столбец с расшифровкой названия тикера, используя данные из файла `sp_data2.csv` . В случае нехватки данных об именах тикеров корректно обработать их.

## Лабораторная работа №2.2

__Данная работа является продолжением ЛР №2. Для начала работы загрузите таблицы (см. задание 1.1)__

In [7]:
recipes = pd.read_csv('C:\\Users\\Артём\\OneDrive - ФГОБУ ВО Финансовый университет при Правительстве РФ\\Учёба\\3 курс\\Технологии обработки BD\\ТОБД22-ПМ20-Материалы к семинарам\\02_pandas\\02_pandas_data\\recipes_sample.csv', sep=',',
                      parse_dates=['submitted'])
reviews = pd.read_csv('C:\\Users\\Артём\\OneDrive - ФГОБУ ВО Финансовый университет при Правительстве РФ\\Учёба\\3 курс\\Технологии обработки BD\\ТОБД22-ПМ20-Материалы к семинарам\\02_pandas\\02_pandas_data\\reviews_sample.csv', sep=',', 
                      parse_dates=['date'], index_col=0)

In [8]:
recipes.head(5)

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients
0,george s at the cove black bean soup,44123,90,35193,2002-10-25,NaN,an original recipe created by chef scott meska...,18.0
1,healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN
2,i can t believe it s spinach,38798,30,1533,2002-08-29,NaN,"these were so go, it surprised even me.",8.0
3,italian gut busters,35173,45,22724,2002-07-27,NaN,my sister-in-law made these for us at a family...,NaN
4,love is in the air beef fondue sauces,84797,25,4470,2004-02-23,4.0,i think a fondue is a very romantic casual din...,NaN

In [9]:
reviews.head(5)

,user_id,recipe_id,date,rating,review
370476,21752,57993,2003-05-01,5,Last week whole sides of frozen salmon fillet ...
624300,431813,142201,2007-09-16,5,So simple and so tasty! I used a yellow capsi...
187037,400708,252013,2008-01-10,4,"Very nice breakfast HH, easy to make and yummy..."
706134,2001852463,404716,2017-12-11,5,These are a favorite for the holidays and so e...
312179,95810,129396,2008-03-14,5,Excellent soup! The tomato flavor is just gre...

In [10]:
recipes.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30000 entries, 0 to 29999
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   name            30000 non-null  object
 1   id              30000 non-null  int64
 2   minutes         30000 non-null  int64
 3   contributor_id  30000 non-null  int64
 4   submitted       30000 non-null  datetime64[ns]
 5   n_steps         18810 non-null  float64
 6   description     29377 non-null  object
 7   n_ingredients   21120 non-null  float64
dtypes: datetime64[ns](1), float64(2), int64(3), object(2)
memory usage: 1.8+ MB

In [11]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 126696 entries, 370476 to 691207
Data columns (total 5 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   user_id    126696 non-null  int64
 1   recipe_id  126696 non-null  int64
 2   date       126696 non-null  datetime64[ns]
 3   rating     126696 non-null  int64
 4   review     126679 non-null  object
dtypes: datetime64[ns](1), int64(3), object(1)
memory usage: 5.8+ MB

### Применение функций к pd.Series и pd.DataFrame

4.1 Напишите функцию, которая переводит минуты в формат "XhYm". Примените эту функцию к столбцу `minutes` таблицы `recipes` (без перезаписи исходного столбца) при помощи метода `map`.

In [12]:
def m_to_hm(m: int) -> str:
    m = str(m // 60) + 'h' + str(m % 60) + 'm' 
    return m



recipes.minutes.map(m_to_hm)

0        1h30m
1        0h10m
2        0h30m
3        0h45m
4        0h25m
         ...
29995    1h20m
29996     4h0m
29997    1h15m
29998     1h0m
29999    0h29m
Name: minutes, Length: 30000, dtype: object

4.2 На основе таблицы `recipes` создайте таблицу, которая содержит только текстовые столбцы (используйте метод `select_dtypes`).  Примените к каждому элементу этой таблицы строковый метод `str.capitalize` при помощи метода `applymap`, не удаляя пропуски.

In [13]:
def cap(s: str) -> str:
    return s.str.capitalize()

recipes_obj = recipes.select_dtypes(include=[object])
recipes_obj = recipes_obj.apply(cap, axis=0)
recipes_obj

,name,description
0,George s at the cove black bean soup,An original recipe created by chef scott meska...
1,Healthy for them yogurt popsicles,My children and their friends ask for my homem...
2,I can t believe it s spinach,"These were so go, it surprised even me."
3,Italian gut busters,My sister-in-law made these for us at a family...
4,Love is in the air beef fondue sauces,I think a fondue is a very romantic casual din...
...,...,...
29995,Zurie s holey rustic olive and cheddar bread,This is based on a french recipe but i changed...
29996,Zwetschgenkuchen bavarian plum cake,"This is a traditional fresh plum cake, thought..."
29997,Zwiebelkuchen southwest german onion cake,This is a traditional late summer early fall s...
29998,Zydeco soup,This is a delicious soup that i originally fou...
29999,Cookies by design cookies on a stick,"I've heard of the 'cookies by design' company,..."

4.3 Напишите функцию, которая принимает на вход серию `pd.Series` и для серий, содержащих текстовые данные, возвращает максимальную длину строк в ней, а для числовых серий возвращает минимальный элемент в этой серии. Примените данную функцию к каждому столбцу таблицы `recipes` при помощи метода `apply`.

In [14]:
def get_stats(x: pd.Series) -> int:
    if x.dtype == 'object':
        return x.str.len().max()
    elif x.dtype == 'float64' or x.dtype == 'int64':
        return x.min()
    
assert get_stats(pd.Series(['a', 'bbbb', 'ccc'])) == 4
assert get_stats(pd.Series([1, 3, 2])) == 1

recipes.apply(get_stats, axis=0)

name                83.0
id                  48.0
minutes              0.0
contributor_id    1530.0
submitted            NaN
n_steps              1.0
description       6321.0
n_ingredients        1.0
dtype: float64

### Группировки таблиц `pd.DataFrame`

5.1 Посчитайте количество рецептов, представленных каждым из участников (`contributor_id`). Какой участник добавил максимальное кол-во рецептов?

In [15]:
recipes.groupby('contributor_id')['id'].count()

contributor_id
1530            5
1533          186
1534           50
1535           40
1538            8
             ...
2001968497      2
2002059754      1
2002234079      1
2002234259      1
2002247884      1
Name: id, Length: 8404, dtype: int64

In [16]:
recipes.groupby('contributor_id')['id'].count().nlargest(1)

contributor_id
89831    421
Name: id, dtype: int64

5.2 Посчитайте средний рейтинг к каждому из рецептов. Для скольких рецептов отсутствуют отзывы? Обратите внимание, что отзыв с нулевым рейтингом или не заполненным текстовым описанием не считается отсутствующим.

In [17]:
reviews.groupby('recipe_id')['rating'].mean()

recipe_id
48        1.000000
55        4.750000
66        4.944444
91        4.750000
94        5.000000
            ...
536547    5.000000
536610    0.000000
536728    4.000000
536729    4.750000
536747    0.000000
Name: rating, Length: 28100, dtype: float64

In [18]:
reviews.iloc[np.where(pd.isnull(reviews))[0]].groupby('recipe_id')['recipe_id'].count()

recipe_id
3662      1
9054      3
15553     1
25190     1
86868     1
89207     1
107786    1
128956    1
155430    1
167202    1
245231    1
335709    1
391660    1
522925    1
524744    1
Name: recipe_id, dtype: int64

In [19]:
# Для скольких рецептов отсутствуют отзывы:
len(reviews.iloc[np.where(pd.isnull(reviews))[0]].groupby('recipe_id')['recipe_id'].count())

15

5.3 Посчитайте количество рецептов с разбивкой по годам создания.

In [20]:
recipes['year'] = recipes.submitted.dt.year

In [21]:
recipes.groupby('year')['id'].count()

year
1999     275
2000     104
2001     589
2002    2644
2003    2334
2004    2153
2005    3130
2006    3473
2007    4429
2008    4029
2009    2963
2010    1538
2011     922
2012     659
2013     490
2014     139
2015      42
2016      24
2017      39
2018      24
Name: id, dtype: int64

5.4 Напишите функцию, которая принимает на вход таблицу (аналогичную `recipes` по набору столбцов), и возвращает `True` в том случае, если в столбце `minutes` присутствуют только значения, меньшие либо равные 10. Сгруппируйте таблицу `recipes` по полю `contributor_id` и для каждого участника выясните, справедливо ли, что все его рецепты занимают не более 10 минут.

In [22]:
def has_only_fast_recipes(x: pd.DataFrame) -> bool:
    if len(x[x.minutes.values <= 10]) == len(x):
        return True

assert not has_only_fast_recipes(
    pd.DataFrame(
        {
            "name": {0: "george s", 1: "healthy"},
            "id": {0: 44123, 1: 67664},
            "minutes": {0: 90, 1: 10},
            "contributor_id": {0: 35193, 1: 91970},
            "submitted": {0: "2002-10-25", 1: "2003-07-26"},
            "n_steps": {0: np.nan, 1: np.nan},
            "description": {0: "123", 1: "zxc"},
            "n_ingredients": {0: 18.0, 1: np.nan},
        }
    )
)
assert has_only_fast_recipes(
    pd.DataFrame(
        {
            "name": {0: "george s", 1: "healthy"},
            "id": {0: 44123, 1: 67664},
            "minutes": {0: 7, 1: 5},
            "contributor_id": {0: 35193, 1: 91970},
            "submitted": {0: "2002-10-25", 1: "2003-07-26"},
            "n_steps": {0: np.nan, 1: np.nan},
            "description": {0: "123", 1: "zxc"},
            "n_ingredients": {0: 18.0, 1: np.nan},
        }
    )
)

In [23]:
recipes.groupby('contributor_id').filter(has_only_fast_recipes)

,name,id,minutes,contributor_id,submitted,n_steps,description,n_ingredients,year
1,healthy for them yogurt popsicles,67664,10,91970,2003-07-26,NaN,my children and their friends ask for my homem...,NaN,2003
44,emerald ecstasy green smoothie,342619,6,1010057,2008-12-09,9.0,this is the delicious green smoothie recipe th...,6.0,2008
46,fraicheur vinaigrette,367987,5,797706,2009-04-26,NaN,this is a lovely salad dressing from a local g...,7.0,2009
93,1 minute cake,290187,2,584365,2008-03-05,20.0,it's not a fancy cake but when you eat it warm...,NaN,2008
109,10 minute chocolate self saucing pudding,402246,10,1464792,2009-12-02,9.0,"got this recipe from the ""essentially food mag...",11.0,2009
...,...,...,...,...,...,...,...,...,...
29723,yum yum avocado salsa,296231,10,808017,2008-04-03,5.0,this is yummy! and healthy!,4.0,2008
29724,yum yum balls,63973,5,88072,2003-06-06,3.0,these chocolate balls are delicious! my family...,NaN,2003
29754,yummy honey and pear sandwiches,171091,2,318506,2006-06-02,3.0,i went looking for sandwich fillings for my on...,4.0,2006
29789,yummy sour cream fruit dip,200350,5,57562,2006-12-12,3.0,mock jason's deli fruit dip. i've made it and ...,3.0,2006
29792,yummy sweet tea,400519,7,281166,2009-11-20,NaN,i bet you can't have just one sip of this deli...,3.0,2009

### Объединение таблиц `pd.DataFrame`

6.1 При помощи объединения таблиц, создайте `DataFrame`, состоящий из четырех столбцов: `id`, `name`, `user_id`, `rating`. Рецепты, на которые не оставлен ни один отзыв, должны отсутствовать в полученной таблице. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и попытавшись найти строку, соответствующую этому рецепту, в полученном `DataFrame`.

In [44]:
new_df = recipes[['id', 'name']].merge(reviews[['user_id','rating','recipe_id']], left_on='id', right_on='recipe_id')
new_df.drop('recipe_id', axis=1, inplace=True)
new_df

            id                                    name  user_id  rating
0        44123   george s at the cove  black bean soup   743566       5
1        44123   george s at the cove  black bean soup    76503       5
2        44123   george s at the cove  black bean soup    34206       5
3        67664      healthy for them  yogurt popsicles   494084       5
4        67664      healthy for them  yogurt popsicles   303445       5
...        ...                                     ...      ...     ...
126691  486161                             zydeco soup   305531       5
126692  486161                             zydeco soup  1271506       5
126693  486161                             zydeco soup   724631       5
126694  486161                             zydeco soup   133174       5
126695  298512  cookies by design   cookies on a stick   804234       1

[126696 rows x 4 columns]

In [45]:
reviews.iloc[np.where(pd.isnull(reviews))[0]].user_id

            user_id  recipe_id       date  rating review
56957    2001567544       9054 2017-06-03       5    NaN
273481   2002120930     167202 2018-04-18       4    NaN
56955    2001508809       9054 2017-04-26       5    NaN
783599   2001959957     335709 2018-01-28       5    NaN
1089381  2002299388      15553 2018-10-13       4    NaN
266359   2002060663     107786 2018-03-18       5    NaN
1078013  2001346906     522925 2017-01-11       4    NaN
841853   1800574364     391660 2018-08-22       5    NaN
1020267  2002005298     245231 2018-02-22       5    NaN
56966    2001826405       9054 2017-11-26       5    NaN
1096338  2001658714     155430 2017-08-05       5    NaN
633479   2002252901      25190 2018-08-29       5    NaN
270484   2001779476       3662 2017-11-05       4    NaN
303674   2001785348     524744 2017-11-26       5    NaN
510473   2002057405      89207 2018-03-17       5    NaN
774321   2001380233     128956 2017-02-05       5    NaN
26786    1803237930      86868 2018-03-20       5    NaN

In [46]:
2001567544 in new_df["user_id"]

False

In [47]:
2002120930 in new_df["user_id"]

False

6.2 При помощи объединения таблиц и группировок, создайте `DataFrame`, состоящий из трех столбцов: `recipe_id`, `name`, `review_count`, где столбец `review_count` содержит кол-во отзывов, оставленных на рецепт `recipe_id`. У рецептов, на которые не оставлен ни один отзыв, в столбце `review_count` должен быть указан 0. Подтвердите правильность работы вашего кода, выбрав рецепт, не имеющий отзывов, и найдя строку, соответствующую этому рецепту, в полученном `DataFrame`.

In [79]:
reviews_2 = reviews.copy()
reviews_2.fillna(0, inplace=True)
review_count = reviews_2.groupby('recipe_id')['review'].count()
review_count

recipe_id
48         2
55         4
66        18
91         4
94         4
          ..
536547     1
536610     1
536728     1
536729     4
536747     4
Name: review, Length: 28100, dtype: int64

In [81]:
reviews_2.isna().sum()

user_id      0
recipe_id    0
date         0
rating       0
review       0
dtype: int64

6.3. Выясните, рецепты, добавленные в каком году, имеют наименьший средний рейтинг?

In [63]:
rating_df = recipes[['id', 'year']].merge(reviews[['rating','recipe_id']], left_on='id', right_on='recipe_id')
rating_df.drop('recipe_id', axis=1, inplace=True)
rating_df

            id  year  rating
0        44123  2002       5
1        44123  2002       5
2        44123  2002       5
3        67664  2003       5
4        67664  2003       5
...        ...   ...     ...
126691  486161  2012       5
126692  486161  2012       5
126693  486161  2012       5
126694  486161  2012       5
126695  298512  2008       1

[126696 rows x 3 columns]

In [70]:
rating_df.groupby('year')['rating'].mean().nsmallest(1)

year
2017    2.75
Name: rating, dtype: float64

### Сохранение таблиц `pd.DataFrame`

7.1 Отсортируйте результат выполнения задания 6.1 в порядке убывания величины столбца `id` и сохраните результаты в csv файл.

In [54]:
new_df.sort_values('id', ascending=False, inplace=True)
new_df

           id                                        name     user_id  rating
71112  536747                          lemon pom pom cake  2002007477       0
71113  536747                          lemon pom pom cake     1460111       0
71115  536747                          lemon pom pom cake  2001996022       0
71114  536747                          lemon pom pom cake  2001285346       0
36928  536729                creole watermelon feta salad     1925885       5
...       ...                                         ...         ...     ...
14328      55  betty crocker s southwestern guacamole dip      165567       5
14329      55  betty crocker s southwestern guacamole dip      851190       5
14330      55  betty crocker s southwestern guacamole dip       53959       4
16365      48                            boston cream pie       32421       0
16366      48                            boston cream pie       68674       2

[126696 rows x 4 columns]

In [57]:
new_df.to_csv('6.1_result.csv', sep=',')
nd = pd.read_csv('6.1_result.csv', sep=',', index_col=0)
nd

           id                                        name     user_id  rating
71112  536747                          lemon pom pom cake  2002007477       0
71113  536747                          lemon pom pom cake     1460111       0
71115  536747                          lemon pom pom cake  2001996022       0
71114  536747                          lemon pom pom cake  2001285346       0
36928  536729                creole watermelon feta salad     1925885       5
...       ...                                         ...         ...     ...
14328      55  betty crocker s southwestern guacamole dip      165567       5
14329      55  betty crocker s southwestern guacamole dip      851190       5
14330      55  betty crocker s southwestern guacamole dip       53959       4
16365      48                            boston cream pie       32421       0
16366      48                            boston cream pie       68674       2

[126696 rows x 4 columns]

7.2 Воспользовавшись `pd.ExcelWriter`, cохраните результаты 6.1 и 6.2 в файл: на лист с названием `Рецепты с оценками` сохраните результаты выполнения 6.1; на лист с названием `Количество отзывов по рецептам` сохраните результаты выполнения 6.2.